    *>    Compile with the command : cobc -x <scirpt.name.cbl>
       
       identification division.
       program-id. hello_world.
       
       
       procedure division.
           display 'Hello World !'.                                     
       stop run.