       identification division.
       program-id. tables.
       
       data division.
       working-storage section.
           
           01 tableau.
               02 entier pic 9 occurs 10.                                                    

       stop run.
